[{
    "id": 1,

    "name": "Aztecs",

    "expansion": "Conquerors",

    "continent": "America",

    "culture": "Native american",

    "army_type": "Infantry and Monk",

    "unique_unit": ["jaguar_warrior"],

    "unique_tech": ["atlatl", "garland_wars"],

    "team_bonus": "Relics generate +33% gold",

    "info": "The Aztecs are a Native American civilization. As such, they lack any access to cavalry, including Cavalry Archers, by default, but since the Definitive Edition they can produce Xolotl Warriors from converted Stables. The Aztecs possess some of the strongest infantry, despite lacking Halberdiers. Their archers are below average without Thumb Ring and Ring Archer Armor, but their Skirmishers are still very strong with Atlatl. The Aztecs are strong in the siege weapon department with Siege Rams, Siege Onagers, and Siege Engineers. Their navy is weak, lacking almost everything apart from the fully upgradable Fast Fire Ship. But their Monks are the best in the game with access to all religious technologies and an extra 5 HP for every one researched. Their defenses are below average. The Aztec economy is one of the strongest in the game, due to their villagers carrying +3 resources.",

    "civilization_bonus": [
        "Villagers carry +5",
        "Military units created 15% faster",
        "+5 Monk hit points for each Monastery technology",
        "Loom free"
    ]
},

{
    "id": 2,

    "name": "Berbers",

    "expansion": "African Kingdoms",

    "continent": "Africa",

    "culture": "Middle eastern",

    "army_type": "Calvary and Naval",

    "unique_unit": ["Camel Archer", "Genitour"],

    "unique_tech": ["Kasbah", "Maghrebi camels"],

    "team_bonus": "Genitour availible at Archery Range",

    "info": "The Berbers are primarily a cavalry civilization, and have very strong and cost-effective cavalry units and an almost full tech tree in the cavalry department, only lacking the Paladin. Their infantry is also good with only the Halberdier missing. Their archers are overall subpar as they lack Arbalesters and Parthian Tactics. Especially the latter is unfortunate as it hinders their unique unit. The siege weapons are average without Siege Rams and Siege Onagers. The navy is another selling point for the Berbers with faster ships and a full tech tree, apart from Shipwright. Their Monks are average, and their defenses rather weak. Their economy, however, is strong with all technologies apart from Two-Man Saw at their disposal, and a great civilization bonus which grants their Villagers +10% movement speed. Overall, the Berbers are mobility-oriented, as they focus on cavalry and accelerated units.",

    "civilization_bonus": [
        "Villagers move +10% faster",
        " Stable units cost -20% (starting in Castle Age)",
        " Ships move +10% faster"
    ]
},

{
    "id": 3,

    "name": "Bohemians",

    "expansion": "Dawn of the Dukes",

    "continent": "Europe",

    "culture": "Eastern european",

    "army_type": "Monks and Gunpowder",

    "unique_unit": ["Hussite Wagon", "Houfnice"],

    "unique_tech": ["Wagenburg Tactics", "Hussite Reforms"],

    "team_bonus": "Markets work 80% faster",

    "info": "The Bohemians are a civilization focused on gunpowder units and Monks. As such, they have solid gunpowder advantages such as early Chemistry and Hand Cannoneers. Their unique units are both gunpowder units as well, which also benefit from Wagonburg Tactics, which increases all gunpowder units' speed. They have cheaper Monasteries to support the creation of Monks, and all Monastery technologies are available. The Hussite Reforms will turn all the gold cost of all Monastery technologies and Monks into food, giving them a potential trash unit. Their infantry is also above average as they get all technologies available with more bonus attack for their Spearman line. The cavalry lines are one of the worst, lacking Bloodlines, Plate Barding Armor, and both Hussar and Paladin upgrades. Their archers are average, with only Thumb Ring missing. The early Chemistry will give them an edge in the Castle Age for their Crossbowmen and Skrimishers. It is noticeable that Cavalry Archers are completely absent from their technology tree. Outside of the Hounfice, their Siege Weapons are average, as they lack Siege Rams and Siege Onagers. Their navy is also terrible, as both Imperial Dock technologies, Heavy Demolition Ships, and Fast Fire Ships are missing. Their defense are average, lacking only Hoardings and Heated Shot. The economy is overall decent, as cheaper Blacksmith, Monastery, and University will save them wood, and they receive free Mining Camp technologies, whlie only Crop Rotation is lacking.",

    "civilization_bonus": [
        "Blacksmiths, Monasteries, and Universities cost -100 wood",
        "Chemistry and Hand Cannoneer available in the Castle Age",
        "The Spearman line deals +25% bonus damage",
        "Fervor and Sanctity affect Villagers",
        "Mining Camp technologies free"
    ]
},

{
    "id": 4,

    "name": "Britons",

    "expansion": "Age of Kings",

    "continent": "Europe",

    "culture": "Western european",

    "army_type": "Foot Archer",

    "unique_unit": ["Longbowman"],

    "unique_tech": ["Yeomen", "Warwolf"],

    "team_bonus": "Archery Ranges work 20% faster",

    "info":"The Britons' main advantages are in their ranged units as they arguably have the best foot archers. They are trained faster and have a very long range. Their infantry is also very good with a complete tech tree. But their mounted units are very underwhelming and their siege weapons are also lacking. This is compensated to a degree by their very dangerous Trebuchets that aim at units with perfect accuracy and deal blast damage thanks to Warwolf. Their navy is strong with a full tech tree apart from Elite Cannon Galleons. The Monks are below average with three technologies missing. Their defensive structures are good, and their economy rather average, although their Shepherd bonus is very helpful early on.",

    "civilization_bonus": [
        "Town Centers cost -50% wood upon reaching the Castle Age",
        "Foot archers (excluding Skirmishers) have +1 range in Castle Age and +1 in Imperial Age (for +2 total)",
        "Shepherds work 25% faster"
    ]
},

{
    "id": 5,

    "name": "Bulgarians",

    "expansion": "Last Khans",

    "continent": "Europe",

    "culture": "Eastern european",

    "army_type": "Infantry and Cavalry",

    "unique_unit": ["Konnik"],

    "unique_tech": ["Stirrups", "Bagains"],

    "team_bonus": "Blacksmiths work 80% faster",

    "info":"Bulgarians are classified as an infantry and cavalry civilization, which is essentially reflected in their unique unit, but both their branches are among the finest in the game; their stable units get all upgrades and technologies excluding the Paladin upgrade (plus having Stirrups to boost the attack speed of all of their cavalry); despite lacking the Champion upgrade, their militia-line upgrades are free and benefit from the additional melee armor of Bagains. Both lines are helped by their fast working Blacksmith (which also benefits their teammates) and with upgrades costing less food. Their Archery Range is on the other hand much weaker by lacking Crossbowman and Ring Archer Armor. Their siege weapons are excellent, as they have all upgrades and only lack Bombard Cannons and save a good amount of food upgrading siege. Their navy and Monks are lackluster, but their defenses are decent, thanks to their Krepost (their unique building which is essentially a lesser version of the Castle and can create Konniks), but still lack other important defensive technologies, and their economy is only hurt a bit by lacking Two-Man Saw and Guilds. They also have a stone discount for their Town Centers. Their Monks are far from the best, and it is worth remembering that Bulgarians with no siege might have a hard time dealing with mass Arbalesters or Cavalry Archers.",

    "civilization_bonus": [
        "Militia line units are upgraded for free",
        "Town Centers cost -50% stone",
        "Blacksmith and Siege Workshop technologies cost -50% food",
        "Can build Krepost"
    ]
},

{
    "id": 6,

    "name": "Burgundians",

    "expansion": "Lords of the West",

    "continent": "Europe",

    "culture": "Western european",

    "army_type": "Cavalry",

    "unique_unit": ["Coustillier", "Flemish Militia"],

    "unique_tech": ["Burgundian Vineyards", "Flemish Revolution"],

    "team_bonus": "Relics generate food in addition to gold",

    "info":"The Burgundians are a cavalry civilization. They lack Bloodlines, but they still have prominent cavalry units such as Hussars, Paladins, and their unique unit, Coustillier, which can charge its attack. Their cheaper Scout and Knight line upgrades will make them easier to fully upgrade. The latter can be upgraded to Cavaliers in the Castle Age. Their infantry is also good, with only Supplies missing. With Flemish Revolution upgraded, their Villagers turn into Flemish Militia, which have a bonus to cavalry. Their archery lines are weak, lacking Arbalest and Heavy Cavalry Archers. To make matters worse, they also lack Thumb Ring, Parthian Tactics and Ring Archer Armor. Still, they have decent Hand Cannoneers, which have more attack. Their siege weapons are also one of the worst, except the Bombard Cannon. Their navy is also somewhat lacking, missing Dry Dock, Heavy Demolition Ships and Shipwright. Their Monks are good, getting all technologies except Heresy and Theocracy. Their defense is perfect, with all technologies available, and they can research all economic upgrades one Age earlier with half food price.",

    "civilization_bonus": [
        "Economic upgrades cost -50% food and are available one Age earlier than other civilizations",
        "Stable technologies are 50% cheaper",
        "Gunpowder units gain +25% attack",
        "Cavalier upgrade available in the Castle Age"
    ]
},

{
    "id": 7,

    "name": "Burmese",

    "expansion": "Rise of Rajas",

    "continent": "Asia",

    "culture": "South-east Asian",

    "army_type": "Monk and Elephant",

    "unique_unit": ["Arambai"],

    "unique_tech": ["Howdah", "Manipur Cavalry"],

    "team_bonus": "Relics are visible on the min map",

    "info":"Standing out for the Burmese are their excellent cavalry, most notably Battle Elephants, their strong infantry, and their great Monks. On the downside, their archers are close to being unusable without key upgrades like Thumb Ring, Arbalester, and Leather Archer Armor. The latter is especially unfortunate as their otherwise strong unique unit, the Arambai, direly misses it. However, it remains a very strong unit and is one of the Burmese's selling points. Their navy and siege weapons are average with a few missing upgrades that do not too much harm overall. The defensive structures are also rather average, but their economy is strong.",

    "civilization_bonus": [
        "Free lumber camp upgrades",
        "Infantry +1 Attacks per Age (starting in Feudal Age)",
        " Monastery techs 50% cheaper"
    ]
},

{
    "id": 8,

    "name": "Byzantines",

    "expansion": "Age of Kings",

    "continent": "Europe",

    "culture": "Mediterranean",

    "army_type": "Defense",

    "unique_unit": ["Cataphract"],

    "unique_tech": ["Greek Fire", "Logistica"],

    "team_bonus": "Monks heal 50% faster",

    "info":"The Byzantines have access to a vast variety of technologies. Standing out are their excellent navy, Monks, and economy, with only a single technology missing (Herbal Medicine) in all three branches put together but with handy perks like Greek Fire and an increased healing speed for Monks. Weak spots in the Byzantine technology tree are hard to make out, but as their lacks in the defenses department (namely Masonry and Architecture) are compensated by a staggering HP bonus for buildings, they are probably best found in their land armies. Their foot archers are excellent, but their Cavalry Archers miss key technologies in Parthian Tactics and Bloodlines. The latter also hurts their cavalry (probably their weakest branch despite having an excellent unique unit there) as well as the missing Blast Furnace which then again does their infantry no favor as well. Working against these disadvantages are their discounts for Camel Riders and Pikemen. Lastly, they lack Siege Engineers, Siege Onagers, and Heavy Scorpions, making their siege department fairly average.",

    "civilization_bonus": [
        "Buildings have +10%/+20%/+30%/+40% HP in the Dark/Feudal/Castle/Imperial Age",
        "Camel Riders, Skirmishers, and the Spearman lines are 25% cheaper",
        "Fire Ships fire 25% faster",
        "Advancing to the Imperial Age is 33% cheaper",
        "Town Watch and Town Patrol are free"
    ]
},

{
    "id": 9,

    "name": "Celts",

    "expansion": "Age of Kings",

    "continent": "Europe",

    "culture": "Western european",

    "army_type": "Infantry and Siege Weapons",

    "unique_unit": ["Woad Raider"],

    "unique_tech": ["Stronghold", "Furor Celtica"],

    "team_bonus": "Siege Workshops work 20% faster",

    "info":"The Celts have very good infantry units with a major advantage in their faster movement speed. The other two main branches, archers and cavalry, are very underwhelming, missing key technologies all over the board. Their use in later stages of the game is usually only considered in special circumstances. Their navy is weak as they lack Fast Fire Ships and Bracer which puts their Galleons at a disadvantage. Their Monks are among the weakest of all, missing five of ten technologies. The defenses are average with two missing upgrades (Bracer and Architecture), but their Castle Age unique technology Stronghold helps slightly. They have arguably the best economy of all civilizations in early to mid game. However, their late game economy is slightly below average due to missing Crop Rotation. Their civilization bonus of efficient lumberjacks (+15%) is better than Two-man Saw (+10%, expensive). Their Siege Workshop is the best of all civilizations. The Celts' siege weapons attack quicker (also affects Trebuchets), are built faster, and are more tanky due to Furor Celtica, making them extremely dangerous. They have the worst Blacksmiths (aside from civilizations lacking cavalry, which naturally lack Cavalry Armor technologies), as they lack three technologies, including the important Bracer.",

    "civilization_bonus": [
        "Infantry units move 15% faster starting from the Feudal Age",
        "Lumberjacks work 15% faster",
        "Siege weapons fire 25% faster",
        "Enemy herdables can be converted regardless of enemy units next to them"
    ]
},

{
    "id": 10,

    "name": "Chinese",

    "expansion": "Age of Kings",

    "continent": "Asia",

    "culture": "East asian",

    "army_type": "Archers",

    "unique_unit": ["Chu Ko Nu"],

    "unique_tech": ["Great Wall", "Rocketry"],

    "team_bonus": "Farms start with +10% food",

    "info":"The Chinese are a very versatile civilization with an overall solid technology tree. Their infantry have all technologies but lack Supplies and foot archers get all the upgrades they could want, and their cavalry is also solid despite missing two final tier upgrades (Paladin and Hussar). The Siege Workshop is average, but their Scorpions get a great attack boost with Rocketry. Their navy is average missing the Fast Fire Ship and Elite Cannon Galleon, but they get fully upgradable Galleons. Their Monks are average, their defenses very good, and their economy is average technology tree-wise, but their +3 Villagers at the game start give them a notable kick start.",

    "civilization_bonus": ["Start game with three extra Villagers, but with -200 food and -50 wood",
        "Town Centers support ten population (instead of five) and have +5 Line of Sight",
        "Technologies are 10%/15%/20% cheaper in the Feudal/Castle/Imperial Age",
        "Demolition Ships have +50% HP"]
},

{
    "id": 11,

    "name": "Cumans",

    "expansion": "Last Khans",

    "continent": "Asia",

    "culture": "Central asian",

    "army_type": "Cavalry",

    "unique_unit": ["Kipchak"],

    "unique_tech": ["Steppe Husbandry", "Cuman Mercenaries"],

    "team_bonus": "Palisade Walls have +33% hit points",

    "info":"The Cumans are classified as a cavalry civilization. Their cavalry is strong, having fully upgraded Hussars, Paladins, and Steppe Lancers, as well as the Steppe Husbandry unique technology, which makes the Scout Cavalry line and Steppe Lancer train 100% faster; furthermore, their cavalry move 5%/10%/15% faster in the Feudal/Castle/Imperial Age. Curiously enough, they are the only camel civilization that does not have access to the Heavy Camel Rider. Their Cavalry Archers are among the best in the game, with fast-firing Kipchaks and Steppe Husbandry allowing the Cavalry Archer line to be created 100% faster; however, their lack of Bracer makes them weaker in the Imperial Age. Foot archers, on the other hand, are rather weak, due to the lack of Bracer, Arbalester and Hand Cannoneer.",

    "civilization_bonus": ["A second Town Center can be built in the Feudal Age",
    "Archery Ranges & Stables cost -100 wood",
    "Siege Workshop & Battering Ram available in Feudal Age; Capped Ram upgrade available in Castle Age",
    "Cavalry move 5%/10%/15% faster in Feudal/Castle/Imperial Age"]
},

{
    "id": 12,

    "name": "Ethiopians",

    "expansion": "African Kingdoms",

    "continent": "Africa",

    "culture": "African",

    "army_type": "Archers and Siege weapons",

    "unique_unit": ["Shotel Warrior"],

    "unique_tech": ["Royal Heirs","Torsion Engines"],

    "team_bonus": "Towers and Outposts have +3 Line of Sight",

    "info":"The Ethiopian Archery Range is decent at best but still one of their greatest assets since their Archers get all upgrades and fire faster. Their infantry is good, lacking the Champion but getting the Shotel Warrior instead. Their cavalry is weak, lacking key units and technologies. Their navy is below average as well, lacking the Fast Fire Ship, Heavy Demolition Ship, and Elite Cannon Galleon. Their Monks do not get Block Printing and Redemption, however they are generally worthy. Their siege weapons are a big selling point for the Ethiopians. They are the only civilization to get all the units available in the Siege Workshop, and have a unique technology that makes the siege engines far more dangerous by increasing their Area of Effect. Their defenses are a bit underwhelming, but their economy is strong, only missing Crop Rotation.",

    "civilization_bonus": ["The Archer line fires 18% faster",
        "Receive +100 food and +100 gold whenever a new Age is reached",
        "The Pikeman upgrade is free"]
},

{
    "id": 13,

    "name": "Franks",

    "expansion": "Age of Kings",

    "continent": "Europe",

    "culture": "Western european",

    "army_type": "Cavalry",

    "unique_unit": ["Throwing Axeman"],

    "unique_tech": ["Bearded Axe", "Chivalry"],

    "team_bonus": "Knights have +2 Line of Sight",

    "info":"The Franks are a straightforward cavalry civilization, with the strongest Knight line of all civilizations and lots of Castles for defense. Despite being generally described as a cavalry civilization, their Stable is rather underwhelming outside of the Knight line, such as fully upgradable Light Cavalry and Paladins. Their infantry is very strong with fully upgraded Champions and Halberdiers. Their archers are weak. The Frankish siege weapons are average, as they lack both the Siege Onager and the Siege Ram. The Franks can use monks with some potential, lacking only Atonement and Redemption. Due to the fact that Castles are 25% cheaper, the Franks can build Castles for a more effective defensive system. That easily compensates the fact they have barely usable towers. Their navy has a hard time keeping up, lacking Elite Cannon Galleon and Shipwright, and the lack of Bracer is a big negative for Frankish Galleons. The Franks get Farm upgrades for free and their Foragers work +15% faster, rendering a fine food economy, but apart from that, their economical technology tree is rather lacking.",

    "civilization_bonus": ["Farm upgrades are free",
    "Castles are 25% cheaper",
    "Mounted units have +20% HP (starting in the Feudal Age)",
    "Foragers work 15% faster"]
},

{
    "id": 14,

    "name": "Goths",

    "expansion": "Age of Kings",

    "continent": "Europe",

    "culture": "Central european",

    "army_type": "Infantry",

    "unique_unit": ["Huskarl"],

    "unique_tech": ["Anarchy", "Perfusion"],

    "team_bonus": "Barracks work 20% faster",

    "info":"The Goths are an infantry civilization. As a result, infantry is the way to go since the Goths' advantages predominantly lay there. The main advantages there are the fast creation speed and low cost which offset lacking Plate Mail Armor by far. The Goths have weak archers, but they can fully upgrade their Skirmishers and Hand Cannoneers. The cavalry branch is not very prominent with the Goths albeit being overall acceptable, featuring Hussars with Bloodlines, but lacking Paladins and Plate Barding Armor. The Siege Workshop is also average without Siege Rams and Siege Onagers. Siege Engineers are also not available, but the Goths primary raiding units are Huskarls, anyway, so this is not that much of a drawback. Their navy is fairly useable, but Dry Dock is missing, so their ships lack speed. The Gothic Monks are way below average, missing four out of ten technologies, and their defenses are downright abysmal. Their economy is good, however.",

    "civilization_bonus": ["Infantry are 20%/25%/30%/35% cheaper in the Dark/Feudal/Castle/Imperial Age",
    "Infantry have +1/+2/+3 attack bonus against standard buildings in the Feudal/Castle/Imperial Age",
    "Villagers have +5 attack against aggressive huntables (Wild Boar, Javelina, Elephant, Rhinoceros) and carry +15 food from hunting",
    "Loom is researched instantly",
    "+10 population cap in the Imperial Age"]
},

{
    "id": 15,

    "name": "Huns",

    "expansion": "Conquerors",

    "continent": "Europe",

    "culture": "Central european",

    "army_type": "Cavalry",

    "unique_unit": ["Tarkan"],

    "unique_tech": ["Marauders", "Atheism"],

    "team_bonus": "Stables work 20% faster",

    "info":"The Huns are a cavalry civilization. As such, they have an ample cavalry tech tree with access to the rare fully upgraded Paladin. Their Cavalry Archers are also very prominent, but the foot archers are somewhat lacking without Ring Archer Armor. Their infantry also lacks the final armor upgrade, Supplies as well as the Champion, making it rather weak overall. Tech tree-wise, the Huns rank way below average in the Monk (missing four out of ten technologies), navy (no Cannon Galleon and Fast Fire Ship), and siege weapon departments (no Onager, Heavy Scorpion, and Bombard Cannon, though they do get Siege Rams); and their late-game economy is also average at best, without Crop Rotation and Stone Shaft Mining. Their defenses are horrible, lacking Fortified Walls, all Watch Tower upgrades, and most technologies affecting structures.",

    "civilization_bonus": ["Start the game with -100 wood, but with the population cap at the maximum",
    "Cavalry Archers are 10%/20% cheaper in the Castle/Imperial Age",
    "Trebuchets have +30% accuracy against units"]
},

{
    "id": 16,

    "name": "Incas",

    "expansion": "Forgotten",

    "continent": "America",

    "culture": "Native american",

    "army_type": "Infantry",

    "unique_unit": ["Kamayuk", "Slinger"],

    "unique_tech": ["Andean Sling", "Fabric Shields"],

    "team_bonus": "Farms are built 100% faster",

    "info":"The Incas are an infantry civilization and the only civilization to have access to all infantry upgrades and technologies, including the Eagle Warrior (with extra armor due to Fabric Shields) that replaces the cavalry branch for the Incas. They also have all upgrades and technologies for their archers (excluding the mounted and gunpowder variants the Incas naturally do not get), and also get a unique unit at the Archery Range: the Slinger. In the siege department they are also very solid, only missing out on Siege Onagers and, logically, Bombard Cannons. The same goes for their navy, where next to the gunpowder ships, only the Heavy Demolition Ship is amiss. Their Monks are average and their defenses very good. They miss Architecture, but their stone discount they get on all buildings makes up for that. Their economy is also pretty good, only Two-Man Saw is missing.",

    "civilization_bonus": ["Start the game with an Eagle Scout",
        "Start with a free Llama",
        "Villagers benefit from Blacksmith infantry upgrades starting in the Castle Age",
        "Houses support 10 population",
        "Buildings cost -15% stone"]
},

{
    "id": 17,

    "name": "Indians",

    "expansion": "Forgotten",

    "continent": "Asia",

    "culture": "South asian",

    "army_type": "Camel riders and Gunpowder units",

    "unique_unit": ["Elephant Archer", "Imperial Camel Rider"],

    "unique_tech": ["Sultans", "Shatagni"],

    "team_bonus": "Camel units have +4 attack against standard buildings",

    "info":"The Indians are classified as a Camel Rider and gunpowder civilization. As such, they have excellent Camels with a unique upgrade, extra pierce armor, an additional attack bonus against standard buildings, and all upgrades (missing only the final armor upgrade). They also have access to the Hussar, but no Knights at their disposal. Still, their cavalry branch is very prominent and strong. Their archers are also very good, most prominently their excellent Cavalry Archers and Hand Cannoneers with both getting all possible upgrades and the latter getting another +1 range from Shatagni, making the Hand Cannoneer one of the most prominent unit in Indian armies. Their infantry misses out on the final armor upgrade but get all unit upgrades. The siege weapons are underwhelming apart from the Bombard Cannon. Their navy is good, but the Fast Fire Ship and Shipwright are missing. Their Monks are average. Their defenses are weak, but their economy is good (only lacking Crop Rotation) and very beneficial for their playing style with faster gold income due to Sultans.",

    "civilization_bonus": ["Fishermen work 10% faster",
        "Villagers are 10%/15%/20%/25% cheaper in the Dark/Feudal/Castle/Imperial Age",
        "Stable units have +1/+2 pierce armor in the Castle/Imperial Age"]
},

{
    "id": 18,

    "name": "Italians",

    "expansion": "Forgotten",

    "continent": "Europe",

    "culture": "Mediterranean",

    "army_type": "Archers and navy",

    "unique_unit": ["Genoese Crossbowman", "Condottiero"],

    "unique_tech": ["Pavise", "Silk Road"],

    "team_bonus": "Condottieri are available at the Barracks",

    "info":"The Italians are mainly an archer and naval civilization. Their Archery Range is pretty fit with all upgrades and technologies for the foot soldiers there. Only their Cavalry Archers are weak. Their Stable units however are good, featuring Hussars and Cavaliers with full upgrades. In the infantry department there is only the Halberdier missing, but they have the Condottiero at their disposal. Apart from the Bombard Cannon which they get at a lower cost the siege weapons are underwhelming for the Italians. However, their Monks and navy are excellent with only one missing feature each. Same goes for their economy, which only lacks Gold Shaft Mining, and their defensive structures, which do not lack a single feature at all.",

    "civilization_bonus": ["Advancing to the next Age is 15% cheaper",
    "Dock and University technologies are 33% cheaper",
    "Fishing Ships are 15% cheaper",
    "Gunpowder units are 20% cheaper"]
},

{
    "id": 19,

    "name": "Japanese",

    "expansion": "Age of Kings",

    "continent": "Asia",

    "culture": "East asian",

    "army_type": "Infantry",

    "unique_unit": ["Samurai"],

    "unique_tech": ["Yasama", "Kataparuto"],

    "team_bonus": "Galleys have a +50% longer Line of Sight",

    "info":"The Japanese are an infantry civilization and command the strongest infantry of all civilizations with all technologies and upgrades available plus a speed boost for their attacks which results in a very high damage output. The Japanese also have superb archers (including Cavalry Archers) which they can also fully upgrade. Only their cavalry is weak and their siege weapons are underwhelming as well but their Trebuchets greatly benefit from Kataparuto meaning their sieging is still fairly effective. Their navy is excellent, only lacking the Heavy Demolition Ship, but with longer-sighted Galleons and all other improvements at their disposal. Their Monks are very good as well, only lacking Heresy. Their defensive structures and economy are below average, however.",

    "civilization_bonus": ["Fishing Ships have double HP, +2 pierce armor, and work 5%/10%/15%/20% faster in the Dark/Feudal/Castle/Imperial Age",
    "Mills, Lumber Camps and Mining Camps are 50% cheaper",
    "Infantry attack 33% faster starting in the Feudal Age"]
},

{
    "id": 20,

    "name": "Khmer",

    "expansion": "Rise of the Rajas",

    "continent": "Asia",

    "culture": "South-east asian",

    "army_type": "Siege weapons and elephants",

    "unique_unit": ["Ballista Elephant"],

    "unique_tech": ["Tusk Swords", "Double Crossbow"],

    "team_bonus": "Scorpions have +1 range",

    "info":"The Khmer are classified as an elephant and siege civilization, and they really shine in their advertised departments. Their Battle Elephants are particularly dangerous as they get a notable speed boost which, along with Husbandry, effectively addresses their greatest weakness which is the low speed (although they are still not fast enough to escape Halberdiers). Additionally, they get +3 attack out of Tusk Swords which lifts their attack to levels only the Elite War Elephant sits in. Their cavalry department in general is fairly usable, too, but they are missing key traits such as the Paladin, which is why the Battle Elephant is usually the cavalry unit of choice. The infantry is rather weak without Champions, Squires, Supplies and Plate Mail Armor. Their archers are average even without Thumb Ring, although their Cavalry Archers get Parthian Tactics. The Khmer siege weapons are excellent for one reason: their Scorpions.",

    "civilization_bonus": ["No buildings are required to advance to the next age or to unlock other buildings",
        "Battle Elephants move 10% faster",
        "Farmers don't carry food but rather add it directly to the stockpile without any drop-off, but work 5% slower",
        "Villagers can garrison in Houses"]
},

{
    "id": 21,

    "name": "Koreans",

    "expansion": "Conquerors",

    "continent": "Asia",

    "culture": "East asian",

    "army_type": "Towers and navy",

    "unique_unit": ["War Wagon", "Turtle Ship"],

    "unique_tech": ["Eupseong", "Shinkichon"],

    "team_bonus": "Mangonel line minimum range reduced to 1",

    "info":"The Koreans focus on ships and towers and are a rather defensive civilization. As such, their non-ranged units are not very prominent. The lack of Blast Furnace hinders infantry and cavalry alike and the latter is further limited in its capabilities by the lack of Bloodlines and Plate Barding Armor. Their archers, however, get all the upgrades there are, including Hand Cannoneers. Their siege weapons are overall average without Heavy Scorpions and Siege Rams, but they get excellent Siege Onagers with greater range and shorter minimum range. Also, they get Bombard Cannons. The Koreans lack Demolition Ships completely, but get Turtle Ships, which are a major asset in naval battles, making the Koreans an overall very strong naval civilization. Their Monks are overall weak. The defensive structures are a selling point for the Koreans despite the missing Hoardings. The towers get all upgrades (most notably Arrowslits), upgrade themselves for free, and the unique technology Eupseong gives them +2 range, bringing the range to a total of 13 - enough to retaliate to even Bombard Cannons (bar Turkish ones). Also, the fortifications are built faster. Put together with the stone mining bonus which increases the stone gathering speed, that makes the Koreans a civilization with outstanding defensive capabilities. The overall good economy is also helpful there.",

    "civilization_bonus": ["Villagers have +3 Line of Sight",
    "Stone Miners work 20% faster",
    "Tower upgrades are free (Bombard Tower requires Chemistry)",
    "Archer Armor upgrades are free",
    "Military units cost –20% less wood (except siege weapons)"]
},

{
    "id": 22,

    "name": "Lithuanians",

    "expansion": "Last Khans",

    "continent": "Europe",

    "culture": "Eastern european",

    "army_type": "Cavalry and monks",

    "unique_unit": ["Leitis"],

    "unique_tech": ["Hill Forts", "Towers shields"],

    "team_bonus": "Monasteries work 20% faster",

    "info":"As a cavalry and Monk civilization, they have complete upgrades and technologies (also access to the Paladin upgrade) for both of their strengths, and the Leitis whose attack ignores melee armor. Furthermore, their Knight line and Leiciai gain +1 attack from each garrisoned Relic (up to +4), making the Lithuanian cavalry a force to fear, and even supreme over other cavalry civilizations such as the Berbers, Franks or Magyars. Their Monasteries also work 20% faster, which synergies with their excellent monks.",

    "civilization_bonus": ["Start with +150 food",
    "Spearman line and Skirmishers move 10% faster",
    "Each garrisoned Relic gives +1 attack to Knights and Leitis (maximum +4)"]
},

{
    "id": 23,

    "name": "Magyars",

    "expansion": "Forgotten",

    "continent": "Europe",

    "culture": "Eastern european",

    "army_type": "Cavalry",

    "unique_unit": ["Magyar Huszar"],

    "unique_tech": ["Corvinian Army", "Recurve bow"],

    "team_bonus": "Foot archers (except Skirmishers) have +2 Line of Sight",

    "info":"The Magyars are a cavalry civilization. As such, they have outstanding mounted units at their disposal. They get the rare Paladin with all upgrades, the Hussar as well, and a Cavalry Archer that has no equal thanks to Recurve Bow. Their foot archers are also very good with their extra long Line of Sight. Their infantry struggles a bit without Plate Mail Armor and Squires. Same goes for their siege weapons which are average at best. Their navy is rather average, and the Monks are rather weak. The defensive structures are also rather lacking and so is their economy.",

    "civilization_bonus": ["Forging, Iron Casting, and Blast Furnace are free.",
    "Scout Cavalry line is 15% cheaper",
    "Villagers kill wild animals in one strike"]
},

{
    "id": 24,

    "name": "Malay",

    "expansion": "Rise of the Rajas",

    "continent": "Asia",

    "culture": "South-east asian",

    "army_type": "Infantry and navy",

    "unique_unit": ["Karambit warrior"],

    "unique_tech": ["Thalassocracy", "Forced levy"],

    "team_bonus": "Docks have double Line of Sight",

    "info":"The Malay are primarily a naval civilization. Consequently, their naval technology tree is flawless apart from the missing Heavy Demolition Ship. Their true strength lies in naval economy, however. Their Fish Traps are cheaper and provide 3 times more food meaning a lot of wood can be saved which can make all the difference especially in longer games. Additionally, they can upgrade their Docks to Harbors which comes in handy when defending Fishing Ships on the shore. As far as their land units are concerned the Malay go for quantity rather than quality and lack really powerful units. A lot of final tier upgrades are missing (e.g. Champion, Hussar, Siege Ram), but they get cost reductions on their Two-Handed Swordsmen and Battle Elephants which makes massing them more easy. Generally speaking, their cavalry is downright terrible without even Chain Barding Armor. The infantry is fair, the archers are as well, at least the non-mounted ones. The siege weapons are rather underwhelming as well, but they do get Siege Engineers and Bombard Cannons. Their Monks are good. Their defensive structures are lacking, but their economy is overall strong.",

    "civilization_bonus": ["Advancing in Age is +66% faster.",
    "Fish Traps are 33% cheaper.",
    "Fish Traps provide 3 times more food.",
    "Battle Elephants are 30% cheaper in the Castle Age, 40% cheaper in the Imperial Age."]
},
{
    "id": 25,

    "name": "Malians",

    "expansion": "African Kingdoms",

    "continent": "Africa",

    "culture": "African",

    "army_type": "Infantry",

    "unique_unit": ["Gbeto"],

    "unique_tech": ["Tigui", "Farimba"],

    "team_bonus": "Universities work +80% faster",

    "info":"The Malians are an infantry civilization. Despite this, they lack key infantry features with the Halberdier and Blast Furnace. Still, their infantry is excellent due to the increased pierce armor and the access to Gbetos that can be a devastating force especially against melee units. Their cavalry is also excellent because of Farimba that gives their Stable units a massive attack boost resulting in their Cavaliers getting a more powerful attack than Paladins and their Light Cavalry and Heavy Camel Rider are the strongest of all civilizations as well. The archers are also good, but suffer from the lack of Bracer. And so does their navy, that is very underwhelming with Galleons and Elite Cannon Galleons also missing. The siege weapons are below average, most notably Siege Rams and Siege Engineers are missing. The Monks are good, only Illumination is missing. Their defensive structures are average, their economy is good.",

    "civilization_bonus": ["Buildings cost -15% wood (except Farms).",
        "Barracks units have +1/+2/+3 pierce armor in the Feudal/Castle/Imperial Age.",
        "Gold Mines last 30% longer."]
},
{
    "id": 26,

    "name": "Mayans",

    "expansion": "Conquerors",

    "continent": "America",

    "culture": "Native american",

    "army_type": "Archers",

    "unique_unit": ["Plumed archer"],

    "unique_tech": ["Hul'che Javelineers", "El Dorado"],

    "team_bonus": "Walls are 50% cheaper",

    "info":"As a Native American civilization, the Mayans lack any form of cavalry and gunpowder. As a replacement, they get the Eagle Warrior which also gets a massive HP boost with El Dorado. Overall, their archer and infantry departments are strong with access to everything that does not ride a horse or wield a firearm (bar the Champion and Supplies). Their siege weapons miss the Siege Onager, but they get the Siege Ram and Heavy Scorpion. On the water, they have a complete tech tree (apart from the Cannon Galleon, naturally). Their Monks are average. Their defensive structures are overall strong and the same goes for their economy.",

    "civilization_bonus": ["Start the game with an Eagle Scout.",
        "Start the game with +1 Villager, but with -50 food.",
        "Resources last 15% longer.",
        "Foot archers (except Skirmishers) are 10%/20%/30% cheaper in the Feudal/Castle/Imperial Age."]
},
{
    "id": 27,

    "name": "Mongols",

    "expansion": "Age of Kings",

    "continent": "Asia",

    "culture": "East asian",

    "army_type": "Cavalry archers",

    "unique_unit": ["Mangudai"],

    "unique_tech": ["Nomads", "Drill"],

    "team_bonus": "",

    "info":"As a cavalry archer civilization, the Mongols have excellent Cavalry Archers, arguably the best of all civilizations. This is due to their higher Rate of Fire which greatly improves the effective damage output of not only Cavalry Archers, but also Mangudai. The other key unit of the Mongol army, the Hussar, comes with great advantages, too, with greater Line of Sight which is extremely beneficial in the very early game for scouting, and higher HP (and in the Definitive Edition, with Steppe Lancers affected by the HP boost). Put all together, these units form a very threatening and very mobile force. This also works great with their excellent siege weapons which also receive a great speed boost thanks to Drill. Outside these areas of expertise the Mongols fare rather poorly. Their other archers and cavalry units miss important upgrades at the Blacksmith. The infantry, however, is solid despite missing the Halberdier and Supplies. On the water, the lack of Dry Dock is really unfortunate since it means their ships miss out on an important speed boost. Otherwise, their navy is fair. Their Monks are among the worst of all civilizations, and their defensive structures and economy are also both very weak.",

    "civilization_bonus": ["Cavalry archers fire 25% faster.",
        "Light Cavalry, Hussars, and Steppe Lancers have +30% HP.",
        "Hunters work +40% faster."]
},
{
    "id": 28,

    "name": "Persians",

    "expansion": "Age of Kings",

    "continent": "Asia",

    "culture": "Middle eastern",

    "army_type": "Cavalry",

    "unique_unit": ["War Elephhant"],

    "unique_tech": ["Kamandaran", "Mahouts"],

    "team_bonus": "Knights have +2 attack against archers",

    "info":"The Persians are a cavalry civilization. They have access to Hussars, Paladins, and Heavy Camels, with all their Stable and Blacksmith upgrades, which also benefits their unique unit, the War Elephant. And these food- and gold-intensive Cavalry units are sustained thanks to faster-working Town Centers, which provide Persians with a quick economic boom that aids into achieving the required Villager production of their key units.",

    "civilization_bonus": ["Start the game with +50 food and +50 wood.",
    "Town Centers and Docks have double HP and work 10%/15%/20% faster in the Feudal/Castle/Imperial Age."]
},
{
    "id": 29,

    "name": "Poles",

    "expansion": "Dawn of the Dukes",

    "continent": "Europe",

    "culture": "Eastern european",

    "army_type": "Cavalry",

    "unique_unit": ["Obuch"],

    "unique_tech": ["Szlachta Privileges", "Lechitic Legacy"],

    "team_bonus": "The Scout Cavalry line has +1 attack vs. archers",

    "info":"The Poles are a versatile civilization with access to wide variety of units. Their Archery Range is solid, having access to all important technologies and units except for Ring Archer Armor, Parthian Tactics, and Hand Cannoneers. Their heavy cavalry puts emphasis on quantity over quality, as Szlachta Privileges makes their Knight unit line cost less, but the Poles lack access to Paladin and Plate Barding Armor. In a similar sense, their Winged Hussars are essentially glass cannon units with Lechitic Legacy allowing their Winged Hussars to deal trample damage. Their infantry is solid, having access to all important upgrades except for Halberdier. Their unique unit, the Obuch, is an infantry unit that can shred enemy armor. Their siege is average at best, as they have access to Bombard Cannons and Siege Rams without Siege Engineers. Their navy is below average, as they miss out a few important technologies. Their Monastery is missing Atonement, Heresy, and Illumination, but all other technologies for their Monks are present. Their economy is solid since their stone miners generate gold; and have access to a unique building, Folwark, which helps food generation by immediately collecting food from nearby Farms built. Their defenses are average, but their villagers have an extra layer of protection from enemy raids by slowly regenerating health.",

    "civilization_bonus": ["Villagers recover 5/10/15/20 HP per minute in the Dark/Feudal/Castle/Imperial Age",
    "The Folwark replaces the Mill",
    "Stone miners generate gold in addition to stone"]
},
{
    "id": 30,

    "name": "Portuguese",

    "expansion": "African Kingdoms",

    "continent": "Europe",

    "culture": "Mediterranean",

    "army_type": "Navy and Gunpowder units",

    "unique_unit": ["Organ gun and Caravel"],

    "unique_tech": ["Carrack", "Arquebus"],

    "team_bonus": "The Line of Sight is shared with the team from the beginning of the game.",

    "info":"As a naval civilization, the Portuguese rely on a strong navy. Their ships are more durable due to their civilization bonus and Carrack and cheaper in terms of gold. Also, they get the Caravel, which can be an asset in large fights as it is capable of damaging multiple ships. On the land, the Portuguese are able to field a versatile army. Their Blacksmith is complete which results in their foot archers being fully upgradable, but their infantry sorely misses Squires as it means they miss out on an important speed bonus. Their cavalry may seem underwhelming without the Paladin and Hussar upgrade, but their Cavalier gets all upgrades and is one of the most cost effective of all units thanks to the gold discount. The gunpowder units deserve a special mentioning for the Portuguese as they can all be fully upgraded and receive a comrade-in-arms with the Organ Gun and an important accuracy boost with Arquebus. Again, the gold discount comes in handy here as these units are all very gold-intensive. Outside of the Bombard Cannon, their siege weapons are way below average, however. Their Monks are very good. The defensive structures rank as above average and their economy is strong, thanks to the Feitoria, which gives a trickle of all resources, and the fact that all of their technologies are researched 30% faster, which means that the Portuguese can maintain a good economy and be technologically ahead of other civilizations.",

    "civilization_bonus": ["All units cost –20% gold.",
        "All ships have +10% HP.",
        "All technologies (excluding advancing ages) are researched 30% faster.",
        "The Feitoria becomes available for building in the Imperial Age."]
},
{
    "id": 31,

    "name": "Saracens",

    "expansion": "Age of Kings",

    "continent": "Asia",

    "culture": "Middle eastern",

    "army_type": "Cavalry and Navy",

    "unique_unit": ["Mameluke"],

    "unique_tech": ["Madrash", "Zealotry"],

    "team_bonus": "Foot archers have +3 attack against standard buildings.",

    "info":"The Saracens are classified as a cavalry and naval civilization. Their cavalry is indeed excellent despite missing even the Cavalier, because they get all other upgrades and a very threatening unique unit from that branch: the Mameluke. On the sea, they get excellent Galleons that fire faster. Their Transport Ships get usable boosts as well, though it must be noted that the Fast Fire Ship and Shipwright are missing. Their foot troops on land do not leave much to be desired. Their archers get every single upgrade, and only the Halberdier upgrade is missing in the infantry department. Also, all gunpowder units are at the Saracens' disposal. Overall, the siege weapons are strong as they lack only the Heavy Scorpion and so are their Monks which get every single upgrade which is very rare. Madrasah furthers the Monks' effectiveness as it, in the long run, effectively makes Monks cheaper. The defensive structures are rather average, and so is their economy, although the greatly reduced commodity trading fee can be a great asset when going for a rush or in the very late game.",

    "civilization_bonus": ["The commodity trading fee is 5%.",
        "Markets cost 75 wood.",
        "Transport Ships have double HP and +5 carry capacity.",
        "Galleys attack 25% faster.",
        "Camel units +10 HP."]
},
{
    "id": 32,

    "name": "Sicilians",

    "expansion": "Lords of the West",

    "continent": "Europe",

    "culture": "Mediterranean",

    "army_type": "Infantry",

    "unique_unit": ["Serjeant"],

    "unique_tech": ["First Crusade", "Hauberk"],

    "team_bonus": "Transport Ships have +5 Line of Sight and cost -50%.",

    "info":"The Sicilians are an infantry civilization. In fact, they have decent all-around military, thanks to their half-bonus-damage bonus, which means they can stay alive a little longer when facing counters. Their infantry can be fully upgraded, and their infantry unique unit, the Serjeant, can build Donjons, which can in turn train further Serjeants. Their Cavalry and Archery are less prominent compared to their infantry, missing Hussars and Paladins at the Stable, and lacking Thumb Ring, Ring Archer Armor, Heavy Cavalry Archer, Hand Cannoneers, and Parthian Tactics, making their Archers still weaker compared with many civilizations despite having Arbalesters. They have above average siege weapons, but the Bombard Cannon are absent. Their Monks are a weakness, due to missing half of the technologies at the Monastery. The same goes for their defenses, though their unique building, the Donjon, is more powerful than a common tower. Still, it does not compensate for missing Architecture and Fortified Walls. Their navy is excellent, with only Elite Cannon Gallons lacking. And their economy is solid, as they have double provided food from Farm technologies and are only missing Two-Man Saw for their economic technologies.",

    "civilization_bonus": ["Start with +100 additional stone.",
        "Castles and Town Centers are constructed 100% faster.",
        "Land military units (except siege units) receive 50% less bonus damage.",
        "Farm upgrades provide +100% additional food to Farms before they need to be reseeded.",
        "Can build Donjons, which replace the regular Watch Tower line."]
},
{
    "id": 33,

    "name": "Slavs",

    "expansion": "Forgotten",

    "continent": "Europe",

    "culture": "Eastern european",

    "army_type": "Infantry and siege weapons",

    "unique_unit": ["Boyar"],

    "unique_tech": ["Orthodoxy", "Druzhina"],

    "team_bonus": "Military buildings (excluding Castles and Docks) provide +5 population.",

    "info":"As an infantry civilization, the Slavs have access to the full infantry technology tree and also get Druzhina, making their infantry units highly useful in mass battles. Their cavalry is also good despite missing out on the Paladin upgrade. The archers, however, are among the worst of all civilizations. This is compensated to a degree by their excellent Siege Workshop units that get a 15% discount. Especially the Heavy Scorpion can fulfill the archers' role for the Slavs. Their navy is weak, although they can fully upgrade their Fire Ships. The Slavic Monks are excellent offensively with every upgrade there plus Orthodoxy which grants them extra armor, making them fearsome in Monk rushes. They lack Heresy and Faith and thus are vulnerable to conversion (Note: Faith was added in the Definitive Edition). Their defensive structures are below average but their faster farming is considered one of the strongest economic bonuses in the game.",

    "civilization_bonus": ["Farmers work 10% faster",
        "Supplies is free",
        "Siege Workshop units are 15% cheaper"]
},
{
    "id": 34,

    "name": "Spanish",

    "expansion": "Conquerors",

    "continent": "Europe",

    "culture": "Mediterranean",

    "army_type": "Gunpowder and Monks",

    "unique_unit": ["Conquistador", "Misionary"],

    "unique_tech": ["Inquisition", "Supremacy"],

    "team_bonus": "Trade units generate +25% gold.",

    "info":"The Spanish are classified as a gunpowder and Monk civilization. They excel at these two particular areas, getting all possible upgrades there bar Siege Engineers as well as specific bonuses and technologies, but the Spanish are far from being limited to their areas of expertise. Their infantry and cavalry units are great and do not miss out on a single feature. The Paladin deserves a special mention here as very few civilizations can utilize them. Their archers rank below average, though. The Spanish navy is simply excellent; their technology tree there is perfect (a feature that is only shared with the Byzantines) and their Cannon Galleons can effectively be used in naval battles and are not limited to razing buildings thanks to the faster and more accurate cannonballs. The siege weapons are overall average, but the faster attacking Bombard Cannons make a notable difference. The defensive structures are also strong for the Spanish, which leaves their economy to be the shallow part in their tree. Overall, the Spanish have a very complete technology tree that enables them to pick from a wide variety of viable strategies.",

    "civilization_bonus": ["Builders work 30% faster (20% for Wonders).",
        "Blacksmith upgrades cost no gold.",
        "Cannon Galleons have better accuracy and faster cannonballs.",
        "Gunpowder units (except Conquistadors) fire 18% faster"]
},
{
    "id": 35,

    "name": "Tatars",

    "expansion": "Last Khans",

    "continent": "Asia",

    "culture": "Central asian",

    "army_type": "Cavalry Archer",

    "unique_unit": ["Keshik", "Flaming Camel"],

    "unique_tech": ["Silk Armor", "Timurid Siegecraft"],

    "team_bonus": "Cavalry Archers have +2 Line of Sight.",

    "info":"The Tatars are classified as a cavalry archer civilization. Their Cavalry Archers are extremely powerful, not only having all possible upgrades (two of those, Parthian Tactics and Thumb Ring, are free for them), they also deal 50% more damage when fight on higher grounds (this bonus applies to all Tatar units), increased Line of Sight (which is their team bonus) and the Silk Armor unique technology, which gives additional melee and pierce armor to them, putting the Tatar cavalry archers at the same level as the Mongol, Hun, Turk, Magyar and Cuman cavalry archers.",

    "civilization_bonus": ["Herdables contain +50% food.",
        "Units do +50% damage when attacking from higher elevations (instead of +25%)",
        "Parthian Tactics and Thumb Ring are free",
        "Two Sheep spawn near newly-constructed Town Centers starting in the Castle Age."]
},
{
    "id": 36,

    "name": "Teutons",

    "expansion": "Age of Kings",

    "continent": "Europe",

    "culture": "Central european",

    "army_type": "Infantry",

    "unique_unit": ["Teutonic Knight"],

    "unique_tech": ["Ironclad", "Crenellations"],

    "team_bonus": "Units resist conversion (half as effective as Faith, but stacks with the effect of this technology).",

    "info":"The Teutons are an infantry civilization. As such, they have excellent infantry with all upgrades, an extra +1/+2 melee armor in the Castle and Imperial ages, and the Teutonic Knight, a unit that is, albeit slow, unrivaled in melee combat. Their cavalry is, in fact, limited to the Paladin, which unfortunately lacks Husbandry and thus misses out on an important speed bonus; it remains a strong unit with +2 melee armor, however. Their archers are very weak, missing improvements all over the board, but Hand Cannoneers are available. The siege weapons are great, mostly due to Ironclad, which helps patch up their main weakness: melee attacks. The Teutonic navy is very underwhelming without Dry Dock and Bracer, which is an unfortunate combination as both the Fire Ship and Galleon are greatly hindered by their absence. Teutonic Monks are excellent. Their defensive capabilities are great, mostly thanks to Crenellations and overall solid defensive structures. Their economy is good, particularly their Farms, which are the most cost effective of all civilizations.",

    "civilization_bonus": ["Monks have double healing range.",
        "Towers garrison twice as many units.",
        "Murder Holes and Herbal Medicine are free.",
        "Farms are 40% cheaper.",
        "Town Centers can garrison +10 units.",
        "Barracks and Stable units receive +1/+2 melee armor in the Castle/Imperial Age."]
},
{
    "id": 37,

    "name": "Turks",

    "expansion": "Age of Kings",

    "continent": "Asia",

    "culture": "Middle eastern",

    "army_type": "Gunpowder units",

    "unique_unit": ["Janissary"],

    "unique_tech": ["Sipahi", "Artillery"],

    "team_bonus": "Gunpowder units are created 25% faster.",

    "info":"The Turks are a gunpowder civilization and arguably have the best units there that have greater range, are created faster, and have more hit points. Apart from gunpowder using soldiers and Champions, the Turkish foot soldiers are very weak. Especially the lack of the Elite Skirmisher and Pikeman can hurt at times. Their mounted units, however, are great. Their cavalry units are complete apart from the Paladin, their Light Cavalry get extra pierce armor, and their Cavalry Archers are among the very best, only seeking competition from the Magyars, Mongols, and Saracens. The siege weapons are good, too, especially the long-ranged Bombard Cannon, but the Onager is missing which can be a disadvantage on densely forested maps like Black Forest as the Turks have no means to quickly cut large numbers of trees. The Turkish navy is very good, only the Fast Fire Ship is missing. Their Monks rank below average, but their defensive structures get all upgrades. Their economy is overall below average without Crop Rotation and Stone Shaft Mining, but their faster gold gathering comes in very handy and greatly benefits their playing style.",

    "civilization_bonus": ["Gunpowder units have +25% HP.",
        "Gunpowder technologies are 50% cheaper; Chemistry is free.",
        "Gold Miners work 20% faster.",
        "Light Cavalry and Hussar upgrades are free.",
        "Scout Cavalry line gain +1 pierce armor."]
},
{
    "id": 38,

    "name": "Vietnamese",

    "expansion": "Rise of the Rajas",

    "continent": "Asia",

    "culture": "East asian",

    "army_type": "Archers",

    "unique_unit": ["Rattan Archer", "Imperial Skirmisher"],

    "unique_tech": ["Chatras", "Paper Money"],

    "team_bonus": "Imperial Skirmishers are available at the Archery Range.",

    "info":"The Vietnamese are an archer civilization with strong emphasis of team support, and their foot archers are excellent soldiers, getting additional HP as well as every upgrade there is. Additionally, their unique unit and team bonus are both foot archers, making the Vietnamese able to pick from a wide variety of different units there. Their infantry and cavalry both miss Blast Furnace, and the latter is especially shallow with other upgrades such as Paladin and Hussar missing. Their Battle Elephants, however, get additional HP out of Chatras and therefore have good defensive capabilities. The siege units are overall weak. Their navy is fair, but the Fast Fire Ship and Shipwright are missing. Their Monks rank below average as well. The defensive structures are overall good, but the lack of Masonry and Architecture is not helping. Their economy is good and especially suited for team games with Paper Money, but the lack of a major early game economic bonus makes the Vietnamese vulnerable to rush strategies.",

    "civilization_bonus": ["Reveal enemy initial Town Centers location at the start of the game.",
        "Archery Range units have +20% HP.",
        "Conscription is free.",
        "Economic upgrades cost no wood."]
},
{
    "id": 39,

    "name": "Vikings",

    "expansion": "Age of Kings",

    "continent": "Europe",

    "culture": "Central european",

    "army_type": "Infantry and Navy",

    "unique_unit": ["Berserk", "Longboat"],

    "unique_tech": ["Chieftains", "Berserkergang"],

    "team_bonus": "Docks are 15% cheaper.",

    "info":"The Vikings are a naval and infantry civilization. Their ships are indeed excellent, coming with a discount which offsets the lack of Shipwright and an excellent unique unit to reinforce their navy. The absence of even Fire Galleys should be noted, though, as it can be a disadvantage early on when Longboats are not yet available. Despite lacking the Halberdier upgrade, their infantry is excellent as well with all upgrades, additional HP, and an excellent unique technology that improves their performance when engaging cavalry units. The latter are very weak for the Vikings themselves, though. Lacking upgrades across the board, most notably Plate Barding Armor, Husbandry, and Bloodlines as well as all final tier upgrades, it is hard to justify their use. Their Cavalry Archers are also not worth considering, but their foot archers definitely are as their Arbalesters get all upgrades. Their other unique unit, the Berserk, is an excellent all-purpose infantry warrior that heal itself, but also Age of Empires II's most expensive units to fully upgrade. Viking siege weapons are somewhat lacking, and their Monks are simply bad. Their defensive structures are not a particular highlight either, but their Castle at least gets all upgrades. Their economy excels at early Castle Age, but lacks before mid-Feudal Age unless it is a water map.",

    "civilization_bonus": ["Wheelbarrow, Hand Cart upgrades free.",
        "Warships cost -15%/-15%/-20% in the Feudal/Castle/Imperial Age.",
        "Infantry have +10/15/20% HP in the Feudal/Castle/Imperial Age."]
}
]